{
  "plugins": {
    "blink-cmp": {
      "src": "https://github.com/Saghen/blink.cmp"
    },
    "copilot": {
      "src": "https://github.com/github/copilot.vim"
    },
    "fzf-lua": {
      "src": "https://github.com/ibhagwan/fzf-lua"
    },
    "gitsigns": {
      "src": "https://github.com/lewis6991/gitsigns.nvim"
    },
    "lualine": {
      "src": "https://github.com/nvim-lualine/lualine.nvim"
    },
    "markview": {
      "src": "https://github.com/OXY2DEV/markview.nvim"
    },
    "mason": {
      "src": "https://github.com/mason-org/mason.nvim"
    },
    "oil": {
      "src": "https://github.com/stevearc/oil.nvim"
    },
    "onedark": {
      "src": "https://github.com/navarasu/onedark.nvim"
    },
    "spectre": {
      "src": "https://github.com/nvim-pack/nvim-spectre"
    },
    "treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter"
    },
    "typst": {
      "src": "https://github.com/chomosuke/typst-preview.nvim"
    }
  }
}